Ran Plan for 4 projects:

1. dir: `terraform/staging/firewall/fw-api` workspace: `default`
1. dir: `terraform/staging/instances/atlantis-server` workspace: `default`
1. dir: `terraform/staging/instances/deploy-server` workspace: `default`
1. dir: `terraform/staging` workspace: `default`

### 1. dir: `terraform/staging/firewall/fw-api` workspace: `default`
<details><summary>Show Output</summary>

```diff
time=2022-11-15T07:02:34Z level=warning msg=Versioning is not enabled for the remote state GCS bucket lendy-terraform-state. We recommend enabling versioning so that you can roll back to previous versions of your Terraform state in case of error. prefix=[/root/.atlantis/repos/Lendy10/terraform/7/default/terraform/staging/firewall/fw-api] 

Initializing the backend...

Successfully configured the backend "gcs"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/google versions matching "4.43.0"...
- Installing hashicorp/google v4.43.0...
- Installed hashicorp/google v4.43.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_firewall.default will be created
  + resource "google_compute_firewall" "default" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "fw-api"
      + network            = "vpc-api"
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]
      + target_tags        = [
          + "allow-ssh-icmp",
        ]

      + allow {
          + ports    = [
              + "22",
              + "80",
            ]
          + protocol = "tcp"
        }
      + allow {
          + ports    = []
          + protocol = "icmp"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /root/.atlantis/repos/Lendy10/terraform/7/default/terraform/staging/firewall/fw-api/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/root/.atlantis/repos/Lendy10/terraform/7/default/terraform/staging/firewall/fw-api/default.tfplan"

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform/staging/firewall/fw-api`
* :put_litter_in_its_place: To **delete** this plan click [here](http://34.101.162.86/lock?id=Lendy10%252Fterraform%252Fterraform%252Fstaging%252Ffirewall%252Ffw-api%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform/staging/firewall/fw-api`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
### 2. dir: `terraform/staging/instances/atlantis-server` workspace: `default`
<details><summary>Show Output</summary>

```diff
time=2022-11-15T07:02:38Z level=warning msg=Versioning is not enabled for the remote state GCS bucket lendy-terraform-state. We recommend enabling versioning so that you can roll back to previous versions of your Terraform state in case of error. prefix=[/root/.atlantis/repos/Lendy10/terraform/7/default/terraform/staging/instances/atlantis-server] 

Initializing the backend...

Successfully configured the backend "gcs"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/google versions matching "4.43.0"...
- Installing hashicorp/google v4.43.0...
- Installed hashicorp/google v4.43.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_instance.default will be created
  + resource "google_compute_instance" "default" {
      + can_ip_forward       = false
      + cpu_platform         = (known after apply)
      + current_status       = (known after apply)
      + deletion_protection  = false
      + guest_accelerator    = (known after apply)
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + label_fingerprint    = (known after apply)
      + machine_type         = "e2-small"
      + metadata_fingerprint = (known after apply)
      + min_cpu_platform     = (known after apply)
      + name                 = "atlantis-server"
      + project              = (known after apply)
      + self_link            = (known after apply)
      + tags                 = [
          + "allow-ssh-icmp",
          + "http-server",
        ]
      + tags_fingerprint     = (known after apply)
      + zone                 = (known after apply)

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "https://www.googleapis.com/compute/v1/projects/ubuntu-os-pro-cloud/global/images/ubuntu-pro-2004-focal-v20221107"
              + labels = (known after apply)
              + size   = (known after apply)
              + type   = (known after apply)
            }
        }

      + confidential_instance_config {
          + enable_confidential_compute = (known after apply)
        }

      + network_interface {
          + ipv6_access_type   = (known after apply)
          + name               = (known after apply)
          + network            = "vpc-api"
          + network_ip         = (known after apply)
          + stack_type         = (known after apply)
          + subnetwork         = "subnet-api"
          + subnetwork_project = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = (known after apply)
            }
        }

      + reservation_affinity {
          + type = (known after apply)

          + specific_reservation {
              + key    = (known after apply)
              + values = (known after apply)
            }
        }

      + scheduling {
          + automatic_restart           = (known after apply)
          + instance_termination_action = (known after apply)
          + min_node_cpus               = (known after apply)
          + on_host_maintenance         = (known after apply)
          + preemptible                 = (known after apply)
          + provisioning_model          = (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ip_private = (known after apply)
  + ip_public  = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /root/.atlantis/repos/Lendy10/terraform/7/default/terraform/staging/instances/atlantis-server/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/root/.atlantis/repos/Lendy10/terraform/7/default/terraform/staging/instances/atlantis-server/default.tfplan"

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform/staging/instances/atlantis-server`
* :put_litter_in_its_place: To **delete** this plan click [here](http://34.101.162.86/lock?id=Lendy10%252Fterraform%252Fterraform%252Fstaging%252Finstances%252Fatlantis-server%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform/staging/instances/atlantis-server`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
### 3. dir: `terraform/staging/instances/deploy-server` workspace: `default`
<details><summary>Show Output</summary>

```diff
time=2022-11-15T07:02:44Z level=warning msg=Versioning is not enabled for the remote state GCS bucket lendy-terraform-state. We recommend enabling versioning so that you can roll back to previous versions of your Terraform state in case of error. prefix=[/root/.atlantis/repos/Lendy10/terraform/7/default/terraform/staging/instances/deploy-server] 

Initializing the backend...

Successfully configured the backend "gcs"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/google versions matching "4.43.0"...
- Installing hashicorp/google v4.43.0...
- Installed hashicorp/google v4.43.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_instance.default will be created
  + resource "google_compute_instance" "default" {
      + can_ip_forward       = false
      + cpu_platform         = (known after apply)
      + current_status       = (known after apply)
      + deletion_protection  = false
      + guest_accelerator    = (known after apply)
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + label_fingerprint    = (known after apply)
      + machine_type         = "e2-small"
      + metadata_fingerprint = (known after apply)
      + min_cpu_platform     = (known after apply)
      + name                 = "deploy-server-check"
      + project              = (known after apply)
      + self_link            = (known after apply)
      + tags                 = [
          + "allow-ssh-icmp",
          + "http-server",
        ]
      + tags_fingerprint     = (known after apply)
      + zone                 = (known after apply)

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "https://www.googleapis.com/compute/v1/projects/ubuntu-os-pro-cloud/global/images/ubuntu-pro-2004-focal-v20221107"
              + labels = (known after apply)
              + size   = (known after apply)
              + type   = (known after apply)
            }
        }

      + confidential_instance_config {
          + enable_confidential_compute = (known after apply)
        }

      + network_interface {
          + ipv6_access_type   = (known after apply)
          + name               = (known after apply)
          + network            = "vpc-atlantis-check"
          + network_ip         = (known after apply)
          + stack_type         = (known after apply)
          + subnetwork         = "subnet-atlantis"
          + subnetwork_project = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = (known after apply)
            }
        }

      + reservation_affinity {
          + type = (known after apply)

          + specific_reservation {
              + key    = (known after apply)
              + values = (known after apply)
            }
        }

      + scheduling {
          + automatic_restart           = (known after apply)
          + instance_termination_action = (known after apply)
          + min_node_cpus               = (known after apply)
          + on_host_maintenance         = (known after apply)
          + preemptible                 = (known after apply)
          + provisioning_model          = (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ip_private = (known after apply)
  + ip_public  = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /root/.atlantis/repos/Lendy10/terraform/7/default/terraform/staging/instances/deploy-server/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/root/.atlantis/repos/Lendy10/terraform/7/default/terraform/staging/instances/deploy-server/default.tfplan"

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform/staging/instances/deploy-server`
* :put_litter_in_its_place: To **delete** this plan click [here](http://34.101.162.86/lock?id=Lendy10%252Fterraform%252Fterraform%252Fstaging%252Finstances%252Fdeploy-server%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform/staging/instances/deploy-server`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
### 4. dir: `terraform/staging` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "terragrunt plan --terragrunt-non-interactive -no-color -out=$PLANFILE $DESTROY_PARAMETER" in "/root/.atlantis/repos/Lendy10/terraform/7/default/terraform/staging": exit status 1: running "terragrunt plan --terragrunt-non-interactive -no-color -out=$PLANFILE $DESTROY_PARAMETER" in "/root/.atlantis/repos/Lendy10/terraform/7/default/terraform/staging": 
time=2022-11-15T07:02:48Z level=warning msg=Versioning is not enabled for the remote state GCS bucket lendy-terraform-state. We recommend enabling versioning so that you can roll back to previous versions of your Terraform state in case of error. prefix=[/root/.atlantis/repos/Lendy10/terraform/7/default/terraform/staging] 
Terraform initialized in an empty directory!

The directory has no Terraform configuration files. You may begin working
with Terraform immediately by creating Terraform configuration files.

Error: No configuration files

Plan requires configuration to be present. Planning without a configuration
would mark everything for destruction, which is normally not what is desired.
If you would like to destroy everything, run plan with the -destroy option.
Otherwise, create a Terraform configuration file (.tf file) and try again.
time=2022-11-15T07:02:48Z level=error msg=Terraform invocation failed in /root/.atlantis/repos/Lendy10/terraform/7/default/terraform/staging
time=2022-11-15T07:02:48Z level=error msg=1 error occurred:
	* exit status 1




```
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
